x1 = int(input("Введите координаты коня по столбцу (x): "))
y1 = int(input("Введите координаты коня по строке (y): "))

x2 = int(input("Введите координаты иной фигуры по столбцу (x): "))
y2 = int(input("Введите координаты иной фигуры по строке (y): "))


# first
if (x2 == (x1 + 2) and y2 == (y1 + 1)) or (x2 == (x1 + 1) and y2 == (y1 + 2)):
    print("Конь бьет фигуру")
# second
elif (x2 == (x1 - 1) and y2 == (y1 + 2)) or (x2 == (x1 - 2) and y2 == (y1 + 1)):
    print("Конь бьет фигуру")
# third
elif (x2 == (x1 - 2) and y2 == (y1 -1)) or (x2 == (x1 - 1) and y2 == (y1 -2)):
    print("Конь бьет фигуру")
# fourth
elif (x2 == (x1 + 1) and y2 == (y1 - 2)) or (x2 == (x1 + 2) and y2 == (y1 - 1)):
    print("Конь бьет фигуру")
else:
    print("Конь не бьет фигуру")
