with open('test.txt', 'a') as file:
    try:
        f = file.read()
    except:
        print()

print(f)

g = open('filname', 'mod')
try:
    pass
except:
    pass
finally:
    g.close()

"""
-----------------------------------------------------------------------------------------------------------------------------------------
|Режим|	Описание
-----------------------------------------------------------------------------------------------------------------------------------------
|'r'  |  Только для чтения.
-----------------------------------------------------------------------------------------------------------------------------------------
|'w'  |  Только для записи. Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb' |  Только для чтения (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb' |  Только для записи (бинарный). Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'r+' |  Для чтения и записи.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb+'|  Для чтения и записи (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'w+' |  Для чтения и записи. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb+'|  Для чтения и записи (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a'  |  Откроет для добавления нового содержимого. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a+' |  Откроет для добавления нового содержимого. Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'ab' |  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'ab+'|  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
Стоит обратить внимание, что в Windows стандартной кодировкой является cp1252, а в Linux — utf-08.
"""